dennisppaul/klangstrom-arduino/stm32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.samplingrate=Sampling Rate
menu.audioblock=Sample per Audio Block

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
#
# BOARD PROPERTIES
#
################################################################################

#
# BSP
#

KLST_SHEEP.name=Klangstrom Board KLST_SHEEP (STM32H743VI)

KLST_SHEEP.build.board=KLST_SHEEP
KLST_SHEEP.build.variant=KLST_SHEEP
#KLST_SHEEP.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
KLST_SHEEP.build.fpu=-mfpu=fpv5-d16
#KLST_SHEEP.build.fpu=-mfpu=fpv4-sp-d16
KLST_SHEEP.build.series=STM32H7xx
KLST_SHEEP.build.flash_offset=0x0
KLST_SHEEP.build.mcu=cortex-m7
KLST_SHEEP.upload.maximum_size=2097152
KLST_SHEEP.upload.maximum_data_size=884736
KLST_SHEEP.build.product_line=STM32H743xx

#
# COMMON
#

KLST_SHEEP.build.core=arduino
KLST_SHEEP.build.variant_h=variant_{build.board}.h
KLST_SHEEP.build.float-abi=-mfloat-abi=hard
KLST_SHEEP.build.ldscript=ldscript.ld
KLST_SHEEP.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
KLST_SHEEP.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
KLST_SHEEP.build.extra_flags=-DKLST_BOARD_{build.board} -DKLST_ARCH=1 -DKLANG_SAMPLES_PER_AUDIO_BLOCK={build.flags.audioblock} -DKLANG_AUDIO_RATE={build.flags.samplingrate} -DKLANG_DEBUG_LEVEL=2 -DKLST_WAVETABLE_INTERPOLATE_SAMPLES=1 -DKLST_USE_CMSIS_DSP -DCORE_CALLBACK
KLST_SHEEP.compiler.cpp.std=gnu++17

#
# MENUS
#

# Audio Properties
KLST_SHEEP.menu.samplingrate.xx48000xx=48000Hz
KLST_SHEEP.menu.samplingrate.xx48000xx.build.flags.samplingrate=48000
KLST_SHEEP.menu.samplingrate.xx44100xx=44100Hz
KLST_SHEEP.menu.samplingrate.xx44100xx.build.flags.samplingrate=44100
KLST_SHEEP.menu.samplingrate.xx22050xx=22050Hz
KLST_SHEEP.menu.samplingrate.xx22050xx.build.flags.samplingrate=22050

KLST_SHEEP.menu.audioblock.128=128 samples
KLST_SHEEP.menu.audioblock.128.build.flags.audioblock=128
KLST_SHEEP.menu.audioblock.2048=2048 samples
KLST_SHEEP.menu.audioblock.2048.build.flags.audioblock=2048
KLST_SHEEP.menu.audioblock.1024=1024 samples
KLST_SHEEP.menu.audioblock.1024.build.flags.audioblock=1024
KLST_SHEEP.menu.audioblock.512=512 samples
KLST_SHEEP.menu.audioblock.512.build.flags.audioblock=512
KLST_SHEEP.menu.audioblock.256=256 samples
KLST_SHEEP.menu.audioblock.256.build.flags.audioblock=256
KLST_SHEEP.menu.audioblock.64=64 samples
KLST_SHEEP.menu.audioblock.64.build.flags.audioblock=64
KLST_SHEEP.menu.audioblock.32=32 samples
KLST_SHEEP.menu.audioblock.32.build.flags.audioblock=32

# Upload menu
KLST_SHEEP.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
KLST_SHEEP.menu.upload_method.swdMethod.upload.protocol=0
KLST_SHEEP.menu.upload_method.swdMethod.upload.options=-g
KLST_SHEEP.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

KLST_SHEEP.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
KLST_SHEEP.menu.upload_method.dfuMethod.upload.protocol=2
KLST_SHEEP.menu.upload_method.dfuMethod.upload.options=-g
KLST_SHEEP.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

# Serialx activation
KLST_SHEEP.menu.xserial.generic=Enabled (generic 'Serial')
KLST_SHEEP.menu.xserial.none=Enabled (no generic 'Serial')
KLST_SHEEP.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
KLST_SHEEP.menu.xserial.disabled=Disabled (No Serial support)
KLST_SHEEP.menu.xserial.disabled.build.xSerial=

# USB connectivity
KLST_SHEEP.menu.usb.none=None
KLST_SHEEP.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
KLST_SHEEP.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
KLST_SHEEP.menu.usb.CDC=CDC (no generic 'Serial')
KLST_SHEEP.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
KLST_SHEEP.menu.usb.HID=HID (keyboard and mouse)
KLST_SHEEP.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
KLST_SHEEP.menu.usb.DEVICE_MOUSE=USB Device MOUSE
KLST_SHEEP.menu.usb.DEVICE_MOUSE.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_MOUSE -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_SHEEP.menu.usb.DEVICE_KEYBOARD=USB Device KEYBOARD
KLST_SHEEP.menu.usb.DEVICE_KEYBOARD.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_KEYBOARD -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_SHEEP.menu.usb.DEVICE_MIDI=USB Device MIDI
KLST_SHEEP.menu.usb.DEVICE_MIDI.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MIDI -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_SHEEP.menu.usb.HOST=USB Host MOUSE+KEYBOARD+MIDI
KLST_SHEEP.menu.usb.HOST.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_SHEEP.menu.usb.HOST_DEVICE_MOUSE=USB Host MOUSE+KEYBOARD+MIDI + USB Device MOUSE
KLST_SHEEP.menu.usb.HOST_DEVICE_MOUSE.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_MOUSE
KLST_SHEEP.menu.usb.HOST_DEVICE_KEYBOARD=USB Host MOUSE+KEYBOARD+MIDI + USB Device KEYBOARD
KLST_SHEEP.menu.usb.HOST_DEVICE_KEYBOARD.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_KEYBOARD
KLST_SHEEP.menu.usb.HOST_DEVICE_MIDI=USB Host MOUSE+KEYBOARD+MIDI + USB Device MIDI
KLST_SHEEP.menu.usb.HOST_DEVICE_MIDI.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MIDI
KLST_SHEEP.menu.xusb.FS=Low/Full Speed
KLST_SHEEP.menu.xusb.HS=High Speed
KLST_SHEEP.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
KLST_SHEEP.menu.xusb.HSFS=High Speed in Full Speed mode
KLST_SHEEP.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

