dennisppaul/klangstrom-arduino/stm32/boards.txt
# Optimizations
KLST_CORE.menu.opt.osstd=Smallest (-Os default)
KLST_CORE.menu.opt.oslto=Smallest (-Os) with LTO
KLST_CORE.menu.opt.oslto.build.flags.optimize=-Os -flto
KLST_CORE.menu.opt.o1std=Fast (-O1)
KLST_CORE.menu.opt.o1std.build.flags.optimize=-O1
KLST_CORE.menu.opt.o1lto=Fast (-O1) with LTO
KLST_CORE.menu.opt.o1lto.build.flags.optimize=-O1 -flto
KLST_CORE.menu.opt.o2std=Faster (-O2)
KLST_CORE.menu.opt.o2std.build.flags.optimize=-O2
KLST_CORE.menu.opt.o2lto=Faster (-O2) with LTO
KLST_CORE.menu.opt.o2lto.build.flags.optimize=-O2 -flto
KLST_CORE.menu.opt.o3std=Fastest (-O3)
KLST_CORE.menu.opt.o3std.build.flags.optimize=-O3
KLST_CORE.menu.opt.o3lto=Fastest (-O3) with LTO
KLST_CORE.menu.opt.o3lto.build.flags.optimize=-O3 -flto
KLST_CORE.menu.opt.ogstd=Debug (-Og)
KLST_CORE.menu.opt.ogstd.build.flags.optimize=-Og

# Debug information
KLST_CORE.menu.dbg.none=None
KLST_CORE.menu.dbg.enable=Enabled (-g)
KLST_CORE.menu.dbg.enable.build.flags.debug=-g

# C Runtime Library
KLST_CORE.menu.rtlib.nano=Newlib Nano (default)
KLST_CORE.menu.rtlib.nanofp=Newlib Nano + Float Printf
KLST_CORE.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
KLST_CORE.menu.rtlib.nanofs=Newlib Nano + Float Scanf
KLST_CORE.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
KLST_CORE.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
KLST_CORE.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
KLST_CORE.menu.rtlib.full=Newlib Standard
KLST_CORE.menu.rtlib.full.build.flags.ldspecs=
